app/serializers/picture_serializer.rb

SELECT  "likes".* FROM "likes" WHERE "likes"."picture_id" = $1 ORDER BY "likes"."id" DESC LIMIT $2  [["picture_id", 1], ["LIMIT", 1]]
---
 def like_count
   if self.object.likes.last