app/controllers/pictures_controller.rb

INSERT INTO "pictures" ("photographer", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["photographer", "Drin"], ["created_at", "2018-06-19 21:30:00.556559"], ["updated_at", "2018-06-19 21:30:00.556559"]]
---
  def create
    @picture = Picture.new(picture_params)
    if @picture.save

UPDATE "pictures" SET "like_count" = $1, "updated_at" = $2 WHERE "pictures"."id" = $3  [["like_count", 1], ["updated_at", "2018-06-19 20:57:53.573397"], ["id", 1]]
---
  def update
   @picture.update(picture_params)

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]
DELETE FROM "pictures" WHERE "pictures"."id" = $1  [["id", 10]]
---
 def destroy
   if @picture.comments
     destroy_comments(@picture)
   end
   @picture.destroy

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]
---
  def destroy_comments(picture)
    picture.comments.destroy_all

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def find_picture
    @picture = Picture.find(params[:id])